# FixedRotation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FixedRotation Property
ParameterTypeId Class See Also
---
"Fixed Rotation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FixedRotation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FixedRotation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FixedRotation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace